---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Enabled
enum: Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption
source: html/e41f4cbb-e7a9-9481-114d-7c1eb851834b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Enabled

For a structural column, enables rigid link formation, unless the neighboring structural beam overrides the setting.
 For a structural beam, enables rigid link formation, overriding the neighboring structural column's setting.